Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8f2b8a8e-4cd3-45e3-89ae-1cc4bd0ff30a">
  <name>ЭлектронноеПисьмоИсходящее</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>УБТ_ВидЭлектронногоСообщения</name>
    <type>
      <types>EnumRef.УБТ_ВидыЭлектронныхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УБТ_БотTelegram</name>
    <type>
      <types>CatalogRef.УБТ_БотыTelegram</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УБТ_ЧатыПолучатели</name>
    <attributes>
      <name>Чат</name>
      <type>
        <types>CatalogRef.УБТ_ЧатыTelegram</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Enums/УБТ_ВидыЭлектронныхСообщений/УБТ_ВидыЭлектронныхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБТ_ВидыЭлектронныхСообщений</name>
  <enumValues>
    <name>ЭлектронноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Documents/ЭлектронноеПисьмоИсходящее/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УБТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("УБТ_ВидЭлектронногоСообщения", Объект.УБТ_ВидЭлектронногоСообщения);

	Если Не ЗначениеЗаполнено(Объект.УБТ_ВидЭлектронногоСообщения) Тогда
		Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.ЭлектронноеПисьмо;
	КонецЕсли;

	УБТ_РазместитьЭлементыTelegramНаФорме();
	УБТ_УстановитьОбработчикКомандыОтправкиСообщения();
	УБТ_УстановитьВидимостьЭлементовПоВидуСообщения();

	Если Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.Telegram Тогда
		УБТ_УстановитьБотаTelegramПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазмещенииЭлементов

&НаСервере
Процедура УБТ_РазместитьЭлементыTelegramНаФорме()

	УБТ_РазместитьПереключательВидаСообщения();
	УБТ_РазместитьРеквизитБотаTelegram();
	УБТ_РазместитьТаблицуЧатовTelegram();

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьПереключательВидаСообщения()

	ЭлементВидЭлектронногоСообщения = Элементы.Вставить("УБТ_ВидЭлектронногоСообщения", Тип("ПолеФормы"),
		Элементы.ГруппаЛево, Элементы.СписокПолучателей);
	ЭлементВидЭлектронногоСообщения.ПутьКДанным = "Объект.УБТ_ВидЭлектронногоСообщения";
	ЭлементВидЭлектронногоСообщения.Вид = ВидПоляФормы.ПолеПереключателя;
	ЭлементВидЭлектронногоСообщения.ВидПереключателя = ВидПереключателя.Тумблер;

	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.УБТ_ВидыЭлектронныхСообщений.ЗначенияПеречисления Цикл
		ЭлементВидЭлектронногоСообщения.СписокВыбора.Добавить(
			Перечисления.УБТ_ВидыЭлектронныхСообщений[ЗначениеПеречисления.Имя], ЗначениеПеречисления.Синоним);
	КонецЦикла;

	ЭлементВидЭлектронногоСообщения.УстановитьДействие("ПриИзменении", "УБТ_ВидЭлектронногоСообщенияПриИзменении");

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьРеквизитБотаTelegram()

	ЭлементБотTelegram = Элементы.Вставить("УБТ_БотTelegram", Тип("ПолеФормы"), Элементы.ГруппаЛево,
		Элементы.СписокПолучателей);
	ЭлементБотTelegram.ПутьКДанным = "Объект.УБТ_БотTelegram";
	ЭлементБотTelegram.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементБотTelegram.АвтоОтметкаНезаполненного = Истина;

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьТаблицуЧатовTelegram()

	ЭлементЧатыПолучатели = Элементы.Вставить("УБТ_ЧатыПолучатели", Тип("ТаблицаФормы"), Элементы.ГруппаЛево,
		Элементы.СписокПолучателей);
	ЭлементЧатыПолучатели.ПутьКДанным = "Объект.УБТ_ЧатыПолучатели";

	КолонкаТаблицы = Элементы.Добавить("УБТ_ЧатыПолучателиЧат", Тип("ПолеФормы"), ЭлементЧатыПолучатели);
	КолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;
	КолонкаТаблицы.ПутьКДанным = "Объект.УБТ_ЧатыПолучатели.Чат";

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура УБТ_ВидЭлектронногоСообщенияПриИзменении(Элемент)

	УБТ_УстановитьОбработчикКомандыОтправкиСообщения();
	УБТ_УстановитьВидимостьЭлементовПоВидуСообщения();

	Если Объект.УБТ_ВидЭлектронногоСообщения = ПредопределенноеЗначение(
		"Перечисление.УБТ_ВидыЭлектронныхСообщений.Telegram") Тогда
		УБТ_УстановитьБотаTelegramПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УБТ_ОтправитьСообщениеПоTelegram(Команда) Экспорт

	ОчиститьСообщения();

	Отказ = Ложь;

	Если Не ЗначениеЗаполнено(Объект.УБТ_БотTelegram) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр(
			"az = 'Mesajı göndərməyi planlaşdırdığınız Telegram botunu göstərin.';en = 'Specify the Telegram bot from which you plan to send the message.';ru = 'Укажите бота Telegram, от лица которого вы планируете отправить сообщение.'"),
			, "УБТ_БотTelegram", , Отказ);
	КонецЕсли;

	Если Объект.УБТ_ЧатыПолучатели.Количество() = 0 Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр(
			"az = 'Ən azı bir mesaj alıcısını göstərin.';en = 'Specify at least one message recipient.';ru = 'Укажите хотя бы одного получателя сообщения.'"),
			, "УБТ_ЧатыПолучатели", , Отказ);

	Иначе

		УБТ_ПроверитьПолучателейСообщенияВTelegram(Отказ);

	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	УБТ_ОтправитьСообщениеПоTelegramНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОтправкаяСообщенияПоTelegram

&НаСервере
Процедура УБТ_ОтправитьСообщениеПоTelegramНаСервере()

	// TODO: Непосредственно отправка сообщения

КонецПроцедуры

&НаКлиенте
Процедура УБТ_ПроверитьПолучателейСообщенияВTelegram(Отказ)

	ТекстСообщения = НСтр(
		"az = 'Mesajın göndəriləcəyi Telegram söhbətini göstərin.';en = 'Specify the Telegram chat to which the message should be sent.';ru = 'Укажите чат Telegram, в который нужно отправить сообщение.'");

	Для Каждого СтрокаТабличнойЧасти Из Объект.УБТ_ЧатыПолучатели Цикл

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Чат) Тогда

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.УБТ_ЧатыПолучатели",
				СтрокаТабличнойЧасти.НомерСтроки, "Чат");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УБТ_УстановитьОбработчикКомандыОтправкиСообщения()

	Если Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.Telegram Тогда
		Команды.Отправить.Действие = "УБТ_ОтправитьСообщениеПоTelegram";
	Иначе
		Команды.Отправить.Действие = "ОтправитьПереслатьВыполнить";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УБТ_УстановитьВидимостьЭлементовПоВидуСообщения()

	Если Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.Telegram Тогда
		Элементы.УБТ_ЧатыПолучатели.Видимость = Истина;
		Элементы.УБТ_БотTelegram.Видимость = Истина;
		Элементы.СписокПолучателей.Видимость = Ложь;
	Иначе
		Элементы.УБТ_ЧатыПолучатели.Видимость = Ложь;
		Элементы.УБТ_БотTelegram.Видимость = Ложь;
		Элементы.СписокПолучателей.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УБТ_УстановитьБотаTelegramПоУмолчанию()

	АктивныеБотыTelegram = Справочники.УБТ_БотыTelegram.АктивныеБотыTelegram();

	Если АктивныеБотыTelegram.Количество() = 1 Тогда
		Объект.УБТ_БотTelegram = АктивныеБотыTelegram[0];
	Иначе
		Объект.УБТ_БотTelegram = Справочники.УБТ_БотыTelegram.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
